// Вивести на сторінку в один рядок через кому числа від 10 до 20

// console.log('start')
// let output = '';

// for (let i = 10; i <= 20; i++) {
//     output += i + ', '
// }
// console.log(output)
// console.log('end')



// - Вивести квадрати чисел від 10 до 20

// console.log('start')
// let output = '';

// for (let i = 10; i <= 20; i++) {
//     output += i * i + ', '
// }
// console.log(output)
// console.log('end')


// - Вивести таблицю множення на 7

// console.log('start')
// let output = '';

// for (let i = 1; i <= 10; i++) {
//     console.log(`7 * ${i} = ${i * 7}`)
// }
// console.log('end')


// -Знайти суму всіх цілих чисел від 1 до 15




// -Знайти добуток усіх цілих чисел від 15 до 35




// -Знайти середнє арифметичне всіх цілих чисел від 1 до 500




// -Вивести суму лише парних чисел в діапазоні від 30 до 80




// - Вивести всі числа в діапазоні від 100 до 200 кратні 3




// -Дано натуральне число. Знайти та вивести на сторінку всі його дільники.




// -Визначити кількість його парних дільників



// -Знайти суму його парних дільників



// -Надрукувати повну таблицю множення від 1 до 10

alert('The end of script4')